examples/performance/01_single_phase_nozzle/flux/tadmor/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (0 0 0)
    (0 0.0380275089987 -0.00166031689934)
    (0 0.0380275089987 0.00166031689934)
    (0.01 0 0)
    (0.01 0.0380275089987 -0.00166031689934)
    (0.01 0.0380275089987 0.00166031689934)
    (0.170207236109 0 0)
    (0.170207236109 0.0137532824212 -0.000600481278596)
    (0.170207236109 0.0137532824212 0.000600481278596)
    (0.182907236109 0 0)
    (0.182907236109 0.0137532824212 -0.000600481278596)
    (0.182907236109 0.0137532824212 0.000600481278596)
    (0.409820590272 0 0)
    (0.409820590272 0.0380275089987 -0.00166031689934)
    (0.409820590272 0.0380275089987 0.00166031689934)
);

blocks
(
    hex (0 3 4 1 0 3 5 2) (8 20 1) simpleGrading (1 0.25 1)
    hex (3 6 7 4 3 6 8 5) (80 20 1) simpleGrading (1 0.25 1)
    hex (6 9 10 7 6 9 11 8) (20 20 1) simpleGrading (1 0.25 1)
    hex (9 12 13 10 9 12 14 11) (100 20 1) simpleGrading (1 0.25 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces ((1 0 0 2));
    }
    outlet
    {
        type patch;
        faces ((12 13 14 12));
    }
    wall
    {
        type wall;
        faces
        (
            (1 4 5 2) (4 7 8 5) (7 10 11 8) (10 13 14 11)
        );
    }
    wedgeBack
    {
        type wedge;
        faces
        (
            (0 1 4 3) (3 4 7 6) (6 7 10 9) (9 10 13 12)
        );
    }
    wedgeFront
    {
        type wedge;
        faces
        (
            (0 3 5 2) (3 6 8 5) (6 9 11 8) (9 12 14 11)
        );
    }
);

mergePatchPairs
(
);
