examples/performance/01_single_phase_nozzle/flux/tadmor/constant/solidRegionProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      solidRegionProperties;
}

schemaVersion 1;

enabled false;
